LES_TPU_Main_A90_V02/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application 	pimpleFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime 	19.000000;

deltaT 	0.000100;

writeControl 	adjustableRunTime;

writeInterval 	1.900000;

purgeWrite 	3;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep 		yes;

maxCo 	5.00;

maxDeltaT 	0.001000;

libs ("libatmosphericModels.so" "libturbulentInflow.so");

functions
{
    #includeFunc  generatedPressureSamplingPoints
    #includeFunc  importedPressureSamplingPoints
    #includeFunc  storyForces
}

// ************************************************************************* //
