LES_TPU_Main_A90_V02/constant/simCenter/input/defaultSamplingPoints.txt
0.07007	0.11011	0.08402
0.07007	0.09009	0.08402
0.07007	0.07007	0.08402
0.07007	0.05005	0.08402
0.07007	0.03003	0.08402
0.07007	0.01001	0.08402
0.07007	-0.01001	0.08402
0.07007	-0.03003	0.08402
0.07007	-0.05005	0.08402
0.07007	-0.07007	0.08402
0.07007	-0.09009	0.08402
0.07007	-0.11011	0.08402
0.05005	0.11011	0.09208
0.05005	0.09009	0.09208
0.05005	0.07007	0.09208
0.05005	0.05005	0.09208
0.05005	0.03003	0.09208
0.05005	0.01001	0.09208
0.05005	-0.01001	0.09208
0.05005	-0.03003	0.09208
0.05005	-0.05005	0.09208
0.05005	-0.07007	0.09208
0.05005	-0.09009	0.09208
0.05005	-0.11011	0.09208
0.03003	0.11011	0.10015
0.03003	0.09009	0.10015
0.03003	0.07007	0.10015
0.03003	0.05005	0.10015
0.03003	0.03003	0.10015
0.03003	0.01001	0.10015
0.03003	-0.01001	0.10015
0.03003	-0.03003	0.10015
0.03003	-0.05005	0.10015
0.03003	-0.07007	0.10015
0.03003	-0.09009	0.10015
0.03003	-0.11011	0.10015
0.01001	0.11011	0.10821
0.01001	0.09009	0.10821
0.01001	0.07007	0.10821
0.01001	0.05005	0.10821
0.01001	0.03003	0.10821
0.01001	0.01001	0.10821
0.01001	-0.01001	0.10821
0.01001	-0.03003	0.10821
0.01001	-0.05005	0.10821
0.01001	-0.07007	0.10821
0.01001	-0.09009	0.10821
0.01001	-0.11011	0.10821
-0.01001	0.11011	0.10821
-0.01001	0.09009	0.10821
-0.01001	0.07007	0.10821
-0.01001	0.05005	0.10821
-0.01001	0.03003	0.10821
-0.01001	0.01001	0.10821
-0.01001	-0.01001	0.10821
-0.01001	-0.03003	0.10821
-0.01001	-0.05005	0.10821
-0.01001	-0.07007	0.10821
-0.01001	-0.09009	0.10821
-0.01001	-0.11011	0.10821
-0.03003	0.11011	0.10014
-0.03003	0.09009	0.10014
-0.03003	0.07007	0.10014
-0.03003	0.05005	0.10014
-0.03003	0.03003	0.10014
-0.03003	0.01001	0.10014
-0.03003	-0.01001	0.10014
-0.03003	-0.03003	0.10014
-0.03003	-0.05005	0.10014
-0.03003	-0.07007	0.10014
-0.03003	-0.09009	0.10014
-0.03003	-0.11011	0.10014
-0.05005	0.11011	0.09208
-0.05005	0.09009	0.09208
-0.05005	0.07007	0.09208
-0.05005	0.05005	0.09208
-0.05005	0.03003	0.09208
-0.05005	0.01001	0.09208
-0.05005	-0.01001	0.09208
-0.05005	-0.03003	0.09208
-0.05005	-0.05005	0.09208
-0.05005	-0.07007	0.09208
-0.05005	-0.09009	0.09208
-0.05005	-0.11011	0.09208
-0.07007	0.11011	0.08401
-0.07007	0.09009	0.08401
-0.07007	0.07007	0.08401
-0.07007	0.05005	0.08401
-0.07007	0.03003	0.08401
-0.07007	0.01001	0.08401
-0.07007	-0.01001	0.08401
-0.07007	-0.03003	0.08401
-0.07007	-0.05005	0.08401
-0.07007	-0.07007	0.08401
-0.07007	-0.09009	0.08401
-0.07007	-0.11011	0.08401
0.03003	0.12012	0.09008
0.01001	0.12012	0.09008
-0.01001	0.12012	0.09008
-0.03003	0.12012	0.09008
0.07007	0.12012	0.07007
0.05005	0.12012	0.07007
0.01001	0.12012	0.07007
-0.03003	0.12012	0.07007
-0.07007	0.12012	0.07007
0.07007	0.12012	0.05005
0.03003	0.12012	0.05005
-0.01001	0.12012	0.05005
-0.05005	0.12012	0.05005
-0.07007	0.12012	0.05005
0.07007	0.12012	0.03003
0.05005	0.12012	0.03003
0.01001	0.12012	0.03003
-0.03003	0.12012	0.03003
-0.07007	0.12012	0.03003
0.07007	0.12012	0.01001
0.03003	0.12012	0.01001
-0.01001	0.12012	0.01001
-0.05005	0.12012	0.01001
-0.07007	0.12012	0.01001
-0.08008	0.11011	0.07007
-0.08008	0.09009	0.07007
-0.08008	0.05005	0.07007
-0.08008	0.01001	0.07007
-0.08008	-0.03003	0.07007
-0.08008	-0.07007	0.07007
-0.08008	-0.11011	0.07007
-0.08008	0.11011	0.05005
-0.08008	0.07007	0.05005
-0.08008	0.03003	0.05005
-0.08008	-0.01001	0.05005
-0.08008	-0.05005	0.05005
-0.08008	-0.09009	0.05005
-0.08008	-0.11011	0.05005
-0.08008	0.11011	0.03003
-0.08008	0.09009	0.03003
-0.08008	0.05005	0.03003
-0.08008	0.01001	0.03003
-0.08008	-0.03003	0.03003
-0.08008	-0.07007	0.03003
-0.08008	-0.11011	0.03003
-0.08008	0.11011	0.01001
-0.08008	0.07007	0.01001
-0.08008	0.03003	0.01001
-0.08008	-0.01001	0.01001
-0.08008	-0.05005	0.01001
-0.08008	-0.09009	0.01001
-0.08008	-0.11011	0.01001
-0.03003	-0.12012	0.08943
-0.01001	-0.12012	0.08943
0.01001	-0.12012	0.08943
0.03003	-0.12012	0.08943
-0.07007	-0.12012	0.07007
-0.03003	-0.12012	0.07007
0.01001	-0.12012	0.07007
0.05005	-0.12012	0.07007
0.07007	-0.12012	0.07007
-0.07007	-0.12012	0.05005
-0.05005	-0.12012	0.05005
-0.01001	-0.12012	0.05005
0.03003	-0.12012	0.05005
0.07007	-0.12012	0.05005
-0.07007	-0.12012	0.03003
-0.03003	-0.12012	0.03003
0.01001	-0.12012	0.03003
0.05005	-0.12012	0.03003
0.07007	-0.12012	0.03003
-0.07007	-0.12012	0.01001
-0.05005	-0.12012	0.01001
-0.01001	-0.12012	0.01001
0.03003	-0.12012	0.01001
0.07007	-0.12012	0.01001
0.08008	-0.11011	0.07007
0.08008	-0.07007	0.07007
0.08008	-0.03003	0.07007
0.08008	0.01001	0.07007
0.08008	0.05005	0.07007
0.08008	0.09009	0.07007
0.08008	0.11011	0.07007
0.08008	-0.11011	0.05005
0.08008	-0.09009	0.05005
0.08008	-0.05005	0.05005
0.08008	-0.01001	0.05005
0.08008	0.03003	0.05005
0.08008	0.07007	0.05005
0.08008	0.11011	0.05005
0.08008	-0.11011	0.03003
0.08008	-0.07007	0.03003
0.08008	-0.03003	0.03003
0.08008	0.01001	0.03003
0.08008	0.05005	0.03003
0.08008	0.09009	0.03003
0.08008	0.11011	0.03003
0.08008	-0.11011	0.01001
0.08008	-0.09009	0.01001
0.08008	-0.05005	0.01001
0.08008	-0.01001	0.01001
0.08008	0.03003	0.01001
0.08008	0.07007	0.01001
0.08008	0.11011	0.01001