LES_TPU_Main_A90_V02/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;    
    location    "0";
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField 	 uniform 0.7665;

boundaryField
{
    inlet
    {
	 type 	 atmBoundaryLayerInletK;
	 Uref 	 7.1482;
	 Zref 	 0.0880;
	 zDir 	 (0.0 0.0 1.0);
	 flowDir 	 (1.0 0.0 0.0);
	 z0 	 uniform 3.0000e-03;
	 zGround 	 uniform 0.0;
    }

    outlet
    {
	 type 	 inletOutlet;
	 inletValue 	 uniform 0.7665;
	 value 	 uniform 0.7665;
    }

    ground 
    {
	 type 	 kqRWallFunction;
	 value 	 uniform 0.0000;
    }
    
    top    
    {
	 type  	 symmetry;
    }

    front    
    {
	 type 	 symmetry;
    }
    
    back    
    {
	 type 	 symmetry;
    }
    
    building 
    {
	 type 	 kqRWallFunction;
	 value 	 uniform 0.766456;
    }
}

// ************************************************************************* //
