LES_TPU_Main_A90_V02/system/baseForces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type        	forces;
libs        	("libforces.so");
patches 	(building);
writeControl 	timeStep;
writeInterval 	10;
porosity     	no;
log           	yes;
pRef       	0.0;
rho    		rhoInf;    
log       	yes;         
rhoInf 		1.0000;
CofR 		(0.0000 0.0000 0.0000);

// ************************************************************************* //
