LES_TPU_Main_A90_V02/system/generatedPressureSamplingPoints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*----------------------------------------------------------------------------

Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

type            probes;
libs            ("libsampling.so");
writeControl 	adjustableRunTime;
writeInterval 	0.002000;

fields 		(p);

probeLocations
(
 (0.076667 -0.120001 0.007000)
 (0.076667 -0.120001 0.021000)
 (0.076667 -0.120001 0.034999)
 (0.076667 -0.120001 0.048999)
 (0.076667 -0.120001 0.062999)
 (0.076667 -0.120001 0.076999)
 (0.076667 -0.120001 0.090998)
 (0.076667 -0.120001 0.104998)
 (0.070000 -0.120001 0.007000)
 (0.070000 -0.120001 0.021000)
 (0.070000 -0.120001 0.034999)
 (0.070000 -0.120001 0.048999)
 (0.070000 -0.120001 0.062999)
 (0.070000 -0.120001 0.076999)
 (0.070000 -0.120001 0.090998)
 (0.070000 -0.120001 0.104998)
 (0.063333 -0.120001 0.007000)
 (0.063333 -0.120001 0.021000)
 (0.063333 -0.120001 0.034999)
 (0.063333 -0.120001 0.048999)
 (0.063333 -0.120001 0.062999)
 (0.063333 -0.120001 0.076999)
 (0.063333 -0.120001 0.090998)
 (0.063333 -0.120001 0.104998)
 (0.056667 -0.120001 0.007000)
 (0.056667 -0.120001 0.021000)
 (0.056667 -0.120001 0.034999)
 (0.056667 -0.120001 0.048999)
 (0.056667 -0.120001 0.062999)
 (0.056667 -0.120001 0.076999)
 (0.056667 -0.120001 0.090998)
 (0.056667 -0.120001 0.104998)
 (0.050000 -0.120001 0.007000)
 (0.050000 -0.120001 0.021000)
 (0.050000 -0.120001 0.034999)
 (0.050000 -0.120001 0.048999)
 (0.050000 -0.120001 0.062999)
 (0.050000 -0.120001 0.076999)
 (0.050000 -0.120001 0.090998)
 (0.050000 -0.120001 0.104998)
 (0.043333 -0.120001 0.007000)
 (0.043333 -0.120001 0.021000)
 (0.043333 -0.120001 0.034999)
 (0.043333 -0.120001 0.048999)
 (0.043333 -0.120001 0.062999)
 (0.043333 -0.120001 0.076999)
 (0.043333 -0.120001 0.090998)
 (0.043333 -0.120001 0.104998)
 (0.036667 -0.120001 0.007000)
 (0.036667 -0.120001 0.021000)
 (0.036667 -0.120001 0.034999)
 (0.036667 -0.120001 0.048999)
 (0.036667 -0.120001 0.062999)
 (0.036667 -0.120001 0.076999)
 (0.036667 -0.120001 0.090998)
 (0.036667 -0.120001 0.104998)
 (0.030000 -0.120001 0.007000)
 (0.030000 -0.120001 0.021000)
 (0.030000 -0.120001 0.034999)
 (0.030000 -0.120001 0.048999)
 (0.030000 -0.120001 0.062999)
 (0.030000 -0.120001 0.076999)
 (0.030000 -0.120001 0.090998)
 (0.030000 -0.120001 0.104998)
 (0.023333 -0.120001 0.007000)
 (0.023333 -0.120001 0.021000)
 (0.023333 -0.120001 0.034999)
 (0.023333 -0.120001 0.048999)
 (0.023333 -0.120001 0.062999)
 (0.023333 -0.120001 0.076999)
 (0.023333 -0.120001 0.090998)
 (0.023333 -0.120001 0.104998)
 (0.016667 -0.120001 0.007000)
 (0.016667 -0.120001 0.021000)
 (0.016667 -0.120001 0.034999)
 (0.016667 -0.120001 0.048999)
 (0.016667 -0.120001 0.062999)
 (0.016667 -0.120001 0.076999)
 (0.016667 -0.120001 0.090998)
 (0.016667 -0.120001 0.104998)
 (0.010000 -0.120001 0.007000)
 (0.010000 -0.120001 0.021000)
 (0.010000 -0.120001 0.034999)
 (0.010000 -0.120001 0.048999)
 (0.010000 -0.120001 0.062999)
 (0.010000 -0.120001 0.076999)
 (0.010000 -0.120001 0.090998)
 (0.010000 -0.120001 0.104998)
 (0.003333 -0.120001 0.007000)
 (0.003333 -0.120001 0.021000)
 (0.003333 -0.120001 0.034999)
 (0.003333 -0.120001 0.048999)
 (0.003333 -0.120001 0.062999)
 (0.003333 -0.120001 0.076999)
 (0.003333 -0.120001 0.090998)
 (0.003333 -0.120001 0.104998)
 (-0.003333 -0.120001 0.007000)
 (-0.003333 -0.120001 0.021000)
 (-0.003333 -0.120001 0.034999)
...
);

// ************************************************************************* //
