LES_TPU_Main_A90_V02/system/importedPressureSamplingPoints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*----------------------------------------------------------------------------

Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

type            probes;
libs            ("libsampling.so");
writeControl 	adjustableRunTime;
writeInterval 	0.002000;

fields 		(p);

probeLocations
(
 (0.070070 0.110110 0.084020)
 (0.070070 0.090090 0.084020)
 (0.070070 0.070070 0.084020)
 (0.070070 0.050050 0.084020)
 (0.070070 0.030030 0.084020)
 (0.070070 0.010010 0.084020)
 (0.070070 -0.010010 0.084020)
 (0.070070 -0.030030 0.084020)
 (0.070070 -0.050050 0.084020)
 (0.070070 -0.070070 0.084020)
 (0.070070 -0.090090 0.084020)
 (0.070070 -0.110110 0.084020)
 (0.050050 0.110110 0.092080)
 (0.050050 0.090090 0.092080)
 (0.050050 0.070070 0.092080)
 (0.050050 0.050050 0.092080)
 (0.050050 0.030030 0.092080)
 (0.050050 0.010010 0.092080)
 (0.050050 -0.010010 0.092080)
 (0.050050 -0.030030 0.092080)
 (0.050050 -0.050050 0.092080)
 (0.050050 -0.070070 0.092080)
 (0.050050 -0.090090 0.092080)
 (0.050050 -0.110110 0.092080)
 (0.030030 0.110110 0.100150)
 (0.030030 0.090090 0.100150)
 (0.030030 0.070070 0.100150)
 (0.030030 0.050050 0.100150)
 (0.030030 0.030030 0.100150)
 (0.030030 0.010010 0.100150)
 (0.030030 -0.010010 0.100150)
 (0.030030 -0.030030 0.100150)
 (0.030030 -0.050050 0.100150)
 (0.030030 -0.070070 0.100150)
 (0.030030 -0.090090 0.100150)
 (0.030030 -0.110110 0.100150)
 (0.010010 0.110110 0.108210)
 (0.010010 0.090090 0.108210)
 (0.010010 0.070070 0.108210)
 (0.010010 0.050050 0.108210)
 (0.010010 0.030030 0.108210)
 (0.010010 0.010010 0.108210)
 (0.010010 -0.010010 0.108210)
 (0.010010 -0.030030 0.108210)
 (0.010010 -0.050050 0.108210)
 (0.010010 -0.070070 0.108210)
 (0.010010 -0.090090 0.108210)
 (0.010010 -0.110110 0.108210)
 (-0.010010 0.110110 0.108210)
 (-0.010010 0.090090 0.108210)
 (-0.010010 0.070070 0.108210)
 (-0.010010 0.050050 0.108210)
 (-0.010010 0.030030 0.108210)
 (-0.010010 0.010010 0.108210)
 (-0.010010 -0.010010 0.108210)
 (-0.010010 -0.030030 0.108210)
 (-0.010010 -0.050050 0.108210)
 (-0.010010 -0.070070 0.108210)
 (-0.010010 -0.090090 0.108210)
 (-0.010010 -0.110110 0.108210)
 (-0.030030 0.110110 0.100140)
 (-0.030030 0.090090 0.100140)
 (-0.030030 0.070070 0.100140)
 (-0.030030 0.050050 0.100140)
 (-0.030030 0.030030 0.100140)
 (-0.030030 0.010010 0.100140)
 (-0.030030 -0.010010 0.100140)
 (-0.030030 -0.030030 0.100140)
 (-0.030030 -0.050050 0.100140)
 (-0.030030 -0.070070 0.100140)
 (-0.030030 -0.090090 0.100140)
 (-0.030030 -0.110110 0.100140)
 (-0.050050 0.110110 0.092080)
 (-0.050050 0.090090 0.092080)
 (-0.050050 0.070070 0.092080)
 (-0.050050 0.050050 0.092080)
 (-0.050050 0.030030 0.092080)
 (-0.050050 0.010010 0.092080)
 (-0.050050 -0.010010 0.092080)
 (-0.050050 -0.030030 0.092080)
 (-0.050050 -0.050050 0.092080)
 (-0.050050 -0.070070 0.092080)
 (-0.050050 -0.090090 0.092080)
 (-0.050050 -0.110110 0.092080)
 (-0.070070 0.110110 0.084010)
 (-0.070070 0.090090 0.084010)
 (-0.070070 0.070070 0.084010)
 (-0.070070 0.050050 0.084010)
 (-0.070070 0.030030 0.084010)
 (-0.070070 0.010010 0.084010)
 (-0.070070 -0.010010 0.084010)
 (-0.070070 -0.030030 0.084010)
 (-0.070070 -0.050050 0.084010)
 (-0.070070 -0.070070 0.084010)
 (-0.070070 -0.090090 0.084010)
 (-0.070070 -0.110110 0.084010)
 (0.030030 0.120120 0.090080)
 (0.010010 0.120120 0.090080)
 (-0.010010 0.120120 0.090080)
 (-0.030030 0.120120 0.090080)
 (0.070070 0.120120 0.070070)
 (0.050050 0.120120 0.070070)
 (0.010010 0.120120 0.070070)
 (-0.030030 0.120120 0.070070)
 (-0.070070 0.120120 0.070070)
 (0.070070 0.120120 0.050050)
 (0.030030 0.120120 0.050050)
 (-0.010010 0.120120 0.050050)
 (-0.050050 0.120120 0.050050)
 (-0.070070 0.120120 0.050050)
 (0.070070 0.120120 0.030030)
 (0.050050 0.120120 0.030030)
 (0.010010 0.120120 0.030030)
 (-0.030030 0.120120 0.030030)
 (-0.070070 0.120120 0.030030)
 (0.070070 0.120120 0.010010)
 (0.030030 0.120120 0.010010)
 (-0.010010 0.120120 0.010010)
 (-0.050050 0.120120 0.010010)
 (-0.070070 0.120120 0.010010)
 (-0.080080 0.110110 0.070070)
 (-0.080080 0.090090 0.070070)
 (-0.080080 0.050050 0.070070)
 (-0.080080 0.010010 0.070070)
 (-0.080080 -0.030030 0.070070)
 (-0.080080 -0.070070 0.070070)
 (-0.080080 -0.110110 0.070070)
 (-0.080080 0.110110 0.050050)
 (-0.080080 0.070070 0.050050)
 (-0.080080 0.030030 0.050050)
 (-0.080080 -0.010010 0.050050)
 (-0.080080 -0.050050 0.050050)
 (-0.080080 -0.090090 0.050050)
 (-0.080080 -0.110110 0.050050)
 (-0.080080 0.110110 0.030030)
 (-0.080080 0.090090 0.030030)
 (-0.080080 0.050050 0.030030)
 (-0.080080 0.010010 0.030030)
 (-0.080080 -0.030030 0.030030)
 (-0.080080 -0.070070 0.030030)
 (-0.080080 -0.110110 0.030030)
 (-0.080080 0.110110 0.010010)
 (-0.080080 0.070070 0.010010)
 (-0.080080 0.030030 0.010010)
 (-0.080080 -0.010010 0.010010)
 (-0.080080 -0.050050 0.010010)
 (-0.080080 -0.090090 0.010010)
 (-0.080080 -0.110110 0.010010)
 (-0.030030 -0.120120 0.089430)
 (-0.010010 -0.120120 0.089430)
 (0.010010 -0.120120 0.089430)
 (0.030030 -0.120120 0.089430)
 (-0.070070 -0.120120 0.070070)
 (-0.030030 -0.120120 0.070070)
 (0.010010 -0.120120 0.070070)
 (0.050050 -0.120120 0.070070)
 (0.070070 -0.120120 0.070070)
 (-0.070070 -0.120120 0.050050)
 (-0.050050 -0.120120 0.050050)
 (-0.010010 -0.120120 0.050050)
 (0.030030 -0.120120 0.050050)
 (0.070070 -0.120120 0.050050)
 (-0.070070 -0.120120 0.030030)
 (-0.030030 -0.120120 0.030030)
 (0.010010 -0.120120 0.030030)
 (0.050050 -0.120120 0.030030)
 (0.070070 -0.120120 0.030030)
 (-0.070070 -0.120120 0.010010)
 (-0.050050 -0.120120 0.010010)
 (-0.010010 -0.120120 0.010010)
 (0.030030 -0.120120 0.010010)
 (0.070070 -0.120120 0.010010)
 (0.080080 -0.110110 0.070070)
 (0.080080 -0.070070 0.070070)
 (0.080080 -0.030030 0.070070)
 (0.080080 0.010010 0.070070)
 (0.080080 0.050050 0.070070)
 (0.080080 0.090090 0.070070)
 (0.080080 0.110110 0.070070)
 (0.080080 -0.110110 0.050050)
 (0.080080 -0.090090 0.050050)
 (0.080080 -0.050050 0.050050)
 (0.080080 -0.010010 0.050050)
 (0.080080 0.030030 0.050050)
 (0.080080 0.070070 0.050050)
 (0.080080 0.110110 0.050050)
 (0.080080 -0.110110 0.030030)
 (0.080080 -0.070070 0.030030)
 (0.080080 -0.030030 0.030030)
 (0.080080 0.010010 0.030030)
 (0.080080 0.050050 0.030030)
 (0.080080 0.090090 0.030030)
 (0.080080 0.110110 0.030030)
 (0.080080 -0.110110 0.010010)
 (0.080080 -0.090090 0.010010)
 (0.080080 -0.050050 0.010010)
 (0.080080 -0.010010 0.010010)
 (0.080080 0.030030 0.010010)
 (0.080080 0.070070 0.010010)
 (0.080080 0.110110 0.010010)
);

// ************************************************************************* //
